# Pandas

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [8]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["Column1","Column2","Column3","Column4"])

In [9]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [7]:
#accessing the elements
df.loc['Row2']

Column1    4
Column2    5
Column3    6
Coumn4     7
Name: Row2, dtype: int32

In [12]:
df.loc['Row4']

Column1    12
Column2    13
Column3    14
Column4    15
Name: Row4, dtype: int32

In [13]:
df.loc[:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [19]:
df.loc['Row2']

Column1    4
Column2    5
Column3    6
Column4    7
Name: Row2, dtype: int32

In [21]:
#accessing elements with the help of indexes
df.iloc[1:,1:3]

      Column2  Column3
Row2        5        6
Row3        9       10
Row4       13       14
Row5       17       18

In [23]:
#Convert dataframes into arrays
df.iloc[:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [24]:
df['Column3'].value_counts()

14    1
6     1
18    1
10    1
2     1
Name: Column3, dtype: int64

In [27]:
df['Column4'].value_counts()

7     1
19    1
11    1
3     1
15    1
Name: Column4, dtype: int64

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 4 columns):
Column1    5 non-null int32
Column2    5 non-null int32
Column3    5 non-null int32
Column4    5 non-null int32
dtypes: int32(4)
memory usage: 280.0+ bytes

In [29]:
df.describe()

         Column1    Column2    Column3    Column4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [30]:
df.corr()

         Column1  Column2  Column3  Column4
Column1      1.0      1.0      1.0      1.0
Column2      1.0      1.0      1.0      1.0
Column3      1.0      1.0      1.0      1.0
Column4      1.0      1.0      1.0      1.0

In [31]:
## URL to CSV

df=pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',
                 sep='\t')

In [32]:
df.head()

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,399
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,374
4,SA0L1,All items less food,1,T,358

In [33]:
## Read Json to CSV

In [36]:
Data = '{"employee_name": "kamal", "email": "kamlesh@gmail.com", "job_profile": [{"title1":"Team Lead", "title2":"Jr. Developer"}]}'
pd.read_json(Data)

,employee_name,email,job_profile
0,kamal,kamlesh@gmail.com,"{'title1': 'Team Lead', 'title2': 'Jr. Develop..."